Revit 2026 API

# RebarConstraintSetToBindHandleWithTarget Method

---

Sets the relationship between two RebarConstrainedHandles.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetToBindHandleWithTarget(
	bool bindsHandleWithTarget
)
```
```vb
Public Sub SetToBindHandleWithTarget (
	bindsHandleWithTarget As Boolean
)
```
```cpp
public:
void SetToBindHandleWithTarget(
	bool bindsHandleWithTarget
)
```
```fsharp
member SetToBindHandleWithTarget :
        bindsHandleWithTarget : bool -> unit
```

#### Parameters

bindsHandleWithTarget Boolean
     False if only the constrained RebarConstrainedHandle follows the target. True if the constrained RebarConstrainedHandle and the target bar handle will be bound and move together.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'. -or- The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'. |

Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'. Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace